espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/radio/wifi/wfx_fmac_driver/firmware/sl_wfx_cmd_api.h
/**
 * @brief Service Set Identifier (SSID) of a network.
 * @details Note that the Ssid element must always contain SL_WFX_SSID_SIZE bytes.
 *          Only the bytes up to SsidLength are considered to be valid, the rest should be set to zero.
 */
typedef struct __attribute__((__packed__)) sl_wfx_ssid_def_s {
  /**
   * @brief Length of SSID data.
   * @details <B>0 - 32</B>: The amount of bytes.
   */
  uint32_t ssid_length;
  /** SSID data. */
  uint8_t  ssid[SL_WFX_SSID_SIZE];
} sl_wfx_ssid_def_t;

/**
 * @brief Security mode bitmask for scan results. Empty if Open network.
 */
typedef struct __attribute__((__packed__)) sl_wfx_security_mode_bitmask_s {
  uint8_t  wep : 1;                                        ///< Network supports WEP
  uint8_t  wpa : 1;                                        ///< Network supports WPA. If both WPA bits are set the network supports mixed mode.
  uint8_t  wpa2 : 1;                                       ///< Network supports WPA2. If both WPA bits are set the network supports mixed mode.
  uint8_t  wpa3 : 1;                                       ///< Network supports WPA3. If multiple WPA bits are set the network supports mixed mode.
  uint8_t  pmf : 1;                                        ///< Networks requires use of Protected Management Frames
  uint8_t  unused : 1;                                     ///< Reserved, set to zero
  uint8_t  psk : 1;                                        ///< Network supports Personal authentication
  uint8_t  eap : 1;                                        ///< Network supports Enterprise authentication
} sl_wfx_security_mode_bitmask_t;

/**
 * @brief Device TX rate set bitmask used in sl_wfx_set_tx_rate_parameters_req_body_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_rate_set_bitmask_s {
  uint8_t  b1Mbps : 1;                                     ///< If set, the device may use 802.11b 1Mbps data rate.
  uint8_t  b2Mbps : 1;                                     ///< If set, the device may use 802.11b 2Mbps data rate.
  uint8_t  b5P5Mbps : 1;                                   ///< If set, the device may use 802.11b 5.5Mbps data rate.
  uint8_t  b11Mbps : 1;                                    ///< If set, the device may use 802.11b 11Mbps data rate.
  uint8_t  unused : 4;                                     ///< Reserved, set to zero
  uint8_t  g6Mbps : 1;                                     ///< If set, the device may use 802.11g 6Mbps data rate.
  uint8_t  g9Mbps : 1;                                     ///< If set, the device may use 802.11g 9Mbps data rate.
  uint8_t  g12Mbps : 1;                                    ///< If set, the device may use 802.11g 12Mbps data rate.
  uint8_t  g18Mbps : 1;                                    ///< If set, the device may use 802.11g 18Mbps data rate.
  uint8_t  g24Mbps : 1;                                    ///< If set, the device may use 802.11g 24Mbps data rate.
  uint8_t  g36Mbps : 1;                                    ///< If set, the device may use 802.11g 36Mbps data rate.
  uint8_t  g48Mbps : 1;                                    ///< If set, the device may use 802.11g 48Mbps data rate.
  uint8_t  g54Mbps : 1;                                    ///< If set, the device may use 802.11g 54Mbps data rate.
  uint8_t  mcs0 : 1;                                       ///< If set, the device may use 802.11n 6.5Mbps data rate.
  uint8_t  mcs1 : 1;                                       ///< If set, the device may use 802.11n 13Mbps data rate.
  uint8_t  mcs2 : 1;                                       ///< If set, the device may use 802.11n 19.5Mbps data rate.
  uint8_t  mcs3 : 1;                                       ///< If set, the device may use 802.11n 26Mbps data rate.
  uint8_t  mcs4 : 1;                                       ///< If set, the device may use 802.11n 39Mbps data rate.
  uint8_t  mcs5 : 1;                                       ///< If set, the device may use 802.11n 52Mbps data rate.
  uint8_t  mcs6 : 1;                                       ///< If set, the device may use 802.11n 58.5Mbps data rate.
  uint8_t  mcs7 : 1;                                       ///< If set, the device may use 802.11n 65Mbps data rate.
  uint8_t  unused2;                                        ///< Reserved, set to zero
} sl_wfx_rate_set_bitmask_t;

/**
 * @brief NS IP address element.
 * @details Note that the IP element must always contain SL_WFX_IPV6_ADDR_SIZE bytes.
 *          Only the bytes up to SsidLength are considered to be valid, the rest should be set to zero.
 */
typedef struct __attribute__((__packed__)) sl_wfx_ns_ip_addr_s {
  /** NS IP address. */
  uint8_t  ipv6_addr[SL_WFX_IPV6_ADDR_SIZE];
} sl_wfx_ns_ip_addr_t;

/**
 * @}
 */

/**
 * @addtogroup WFM_GROUP_CONCEPTS
 * @{
 */

/**
 * @page WFM_CONCEPT_SSID Service Set Identifier
 * @par
 * Service Set Identifier (SSID) is an unique identifier of a Wi-Fi network that can be
 * seen as a network name since it's typically an ASCII or UTF8 string.
 * @par
 * SSID contains 0 to 32 bytes of data. When SSID is 0 bytes long, it's known as
 * a broadcast SSID or a wildcard SSID.
 */

/**
 * @page WFM_CONCEPT_BSSID Basic Service Set Identifier
 * @par
 * Basic Service Set Identifier (BSSID) is an unique identifier of a Wi-Fi Access Point.
 * BSSID is a 6-byte field set in the same format as an IEEE 802 MAC address.
 * <BR>See @ref WFM_CONCEPT_MAC for further details.
 */

/**
 * @page WFM_CONCEPT_MAC Media Access Control address
 * @par Broadcast MAC address
 * When all bytes of the MAC address field are set to 0xFF, the MAC address is considered
 * to be a broadcast MAC address.
 * @code
 * { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF }
 * @endcode
 *
 * @par Multicast MAC address
 * When the lowest bit of the first byte is set, the MAC address is considered to
 * be a multicast MAC address.
 * @code
 * { 0x33, 0x33, 0x00, 0x00, 0x00, 0x01 }
 * @endcode
 *
 * @par Zero MAC address
 * When all bytes of the MAC address field are set to 0x00, the MAC address is considered
 * to be a zero MAC address.
 * @code
 * { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }
 * @endcode
 */

/**
 * @page WFM_CONCEPT_VENDOR_IE Vendor-Specific IE
 * @par
 * 802.11 Vendor-specific element starts with a 1-byte Element ID (0xDD), followed by 1-byte Element Length
 * specifying the amount of bytes after the length field. The next field is Organization Identifier (OUI)
 * field which is typically at least 3 bytes, followed by the vendor-specific content.
 * @par
 * An example of a vendor-specific IE that uses a Silicon Laboratories OUI (90-FD-9F),
 * a vendor-specific type of 0 and vendor-specific data "HELLO".
 * @code
 * { 0xDD, 0x09, 0x90, 0xFD, 0x9F, 0x00, 0x48 0x,45 0x4C, 0x4C, 0x4F }
 * @endcode
 */

/**
 * @page WFM_CONCEPT_PASSWORD Passwords and pass phrases
 * @par
 * Note that the Password element must always contain SL_WFX_PASSWORD_SIZE bytes.
 * Only the bytes up to PasswordLength are considered to be valid, the rest are ignored.
 * @par An example of a 64-bit WEP key "12345" in ASCII format
 * @code
 * { 0x31, 0x32, 0x33, 0x34, 0x35 }
 * @endcode
 *
 * @par An example of a 64-bit WEP key "\x31\x32\x33\x34\x35" in HEX format
 * @code
 * { 0x33, 0x31, 0x33, 0x32, 0x33, 0x33, 0x33, 0x34, 0x33, 0x35 }
 * @endcode
 */

/**
 * @page WFM_CONCEPT_RCPI Received Channel Power Indicator
 * @par
 * Received Channel Power Indicator (RCPI) is a monotonically increasing,
 * logarithmic function of the received power level.
 * | Value     | Description |
 * |-----------|-------------|
 * |        0  | Power level is less than -109.5 dBm         |
 * |   1 - 219 | Power level is between -109.5 dBm and 0 dBm |
 * |       220 | Power level is equal or greater than 0 dBm  |
 * | 221 - 255 | Reserved
 *
 * The following equation can be used to convert the RCPI value to corresponding dBm value.
 * <BR>[signal level in dBm] = (RCPI / 2) - 110
 * <BR>RCPI 60 => signal level is -80 dBm
 * <BR>RCPI 80 => signal level is -70 dBm
 */

/**
 * @page WFM_CONCEPT_PM Power management
 * @par
 * In Wi-Fi power management, a device has two power modes: active and power save. In active mode,
 * the device can transmit and receive packets. When in power save, the device has signaled
 * other devices it's available only periodically and communicating with it requires specific
 * power management procedures.
 * @par
 * Wi-Fi power management is different from device power management. Even when the device
 * has enabled Wi-Fi power save, it doesn't necessarily mean the device is actually in a
 * low-power state. Wi-Fi power save must be enabled to use device power management
 * but not vice versa.
 * @par
 * Wi-Fi power save is only available in Wi-Fi client role. The functionality can be controlled
 * using sl_wfx_set_pm_mode_req_t message. The device has three different power management modes.
 * @par WFM_PM_MODE_ACTIVE
 * In this mode, the device does not use Wi-Fi power management. Since no special power management
 * procedures are required, this mode gives the best throughput and latency. Device power management
 * cannot be used in this mode. This is the default mode after the connection has been established.
 * @par WFM_PM_MODE_BEACON
 * In this mode, the device signals to the Wi-Fi Access Point it's in power save and therefore only
 * available on periodic intervals. This causes the Access Point to buffer packets destined
 * to the device until the device retrieves them and therefore causes extra delays on received
 * packets. However, the mode allows the device to use device power management.
 * @par WFM_PM_MODE_DTIM
 * This mode is similar to WFM_PM_MODE_BEACON but it uses a different periodic interval called
 * DTIM period. The length of the DTIM period depends on the access point used but it is at least
 * as long as the period in WFM_PM_MODE_BEACON.
 */

/**
 * @page WFM_CONCEPT_HIDDEN Hidden network
 * @par
 * Usually, a Wi-Fi Access Point will advertise its details in Beacon frames as well as in
 * Probe Response frames which are sent as a response to Probe Request frames. One of the
 * details advertised is the SSID of the network.
 * @par
 * When the network is hidden, the device will replace the actual SSID in Beacon frames with
 * a broadcast SSID and will stop responding to Probe Requests that do not specify the correct
 * SSID. In practice, other stations will still see there is a network near-by due to the
 * Beacon frames but they will not be able to determine the SSID.
 * @par
 * This feature shouldn't be seen as a security feature since it's fairly simple to determine
 * the SSID by passively observing stations that know the correct SSID.
 */

/**
 * @page WFM_CONCEPT_ISOLATION Client isolation
 * @par
 * When a Wi-Fi network has multiple stations connected, they communicate with each other
 * by first sending the data frame to the Access Point. Access Point then determines the
 * destination is one of its clients and resends the frame to the destination station.
 *
 * When the client isolation is enabled, the Access Point discards all data frames intended
 * for other stations. Therefore, the stations will only be able to communicate with the
 * access point.
 */

/**
 * @page WFM_CONCEPT_PACKET Packet types
 * @par Data frame with Ethernet II header
 * When transmitting and receiving data frames in this format, the payload message such as
 * an IP packet or an ARP packet is encapsulated in an Ethernet II frame header without the
 * trailing CRC checksum.
 * @par
 * Ethernet II headers is 14 bytes (6-byte Destination MAC address, 6-byte Source MAC Address,
 * 2-byte EtherType). The EtherType is written in big-endian format.
 * @par
 * An ARP packet (EtherType 0x0806) sent to the broadcast address (FF:FF:FF:FF:FF:FF)
 * from the source MAC address (00:01:02:03:04:05) therefore starts with the header
 * @code
 * { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x08, 0x06 }
 * @endcode
 * and is immediately followed by the actual ARP packet.
 */

/**
 * @page WFM_CONCEPT_SCAN Scanning
 * @par Scan mode
 * The device supports two modes of scanning: active and passive. In passive mode, the device
 * switches to each channel to be scanned in turn and listens for Access Points operating
 * on the channel. After a time limit, it switches to the next channel.
 * @par
 * The active mode is similar to the passive mode but in addition to listening, the device
 * will solicit advertisements from the access points on the channel. Whether an Access
 * Point responds to a solicitation depends on the SSID(s) used in the scan. If the scan
 * is performed with a wildcard SSID, all access points on the channel will respond. If
 * performed with a specific SSID, only the access points having that SSID will respond.
 * @par
 * Note that even when scanning with a specific SSID, the scan results may contain other
 * access points if the device happened to hear the advertisement while on the channel.
 * @par Specific channel list
 * It's possible to specify a list of channels to be scanned. The channel list
 * is an array of bytes, one byte per channel. The channels are scanned in the order given.
 * @par
 * An example of channels list (1, 6, 11)
 * @code
 * { 0x01, 0x06, 0x11 }
 * @endcode
 * @par Specific SSID list
 * When performing an active scan, a list of SSIDs to be scanned can be specified. Only
 * the SSIDs on the list will be queried. The lists consists of multiple sl_wfx_ssid_def_t elements
 * concatenated together.
 * @par Scan Parameters
 * In the command sl_wfx_set_scan_parameters_req_t, it is possible to specify some scan parameters that will
 * apply to every subsequent scan. It must be noted that parameters that do not comply
 * with the current environment will be overridden internally (e.g., a very long scan
 * that would jeopardize the current connection will be made shorter). In this case, a WFM_STATUS_WARNING
 * will be issued in sl_wfx_start_scan_cnf_t. It is the advised that the host adjusts the scan parameters.
 */

/**
 * @page WFM_CONCEPT_OFFLOADING Offloading
 * @par
 * To facilitate low-power use-cases, there is a possibility to offload
 * replying to Address Resolution Protocol (ARP) requests and IPv6 Neighbor Solicitation (NS)
 * packets to the device. By default, the offloading functionality is disabled.
 * @par ARP offloading
 * When the functionality is enabled, the device will respond to ARP requests that
 * specify one of the configured IPv4 addresses. The request is not forwarded to
 * the host. The functionality can be controlled using sl_wfx_set_arp_ip_address_req_t message.
 * @par NS offloading
 * When the functionality is enabled, the device will respond to IPv6 NS packets that
 * specify one of the configured IPv6 addresses. The request is not forwarded to
 * the host. The functionality can be controlled using sl_wfx_set_ns_ip_address_req_t message.
 */

/**
 * @page WFM_CONCEPT_FILTERING Filtering
 * @par
 * By default, the device forwards all packets it receives from the network to the host.
 * In a busy network, processing the broadcast and the multicast traffic may be a significant
 * source of power consumption on the host. To facilitate low-power use-cases, the
 * device offers multiple options for discarding some of the received packets on the device.
 * @par Multicast filtering
 * Filtering of multicast traffic is based on a whitelist of destination multicast addresses.
 * Any received packet whose destination address does not match the whitelist is automatically
 * discarded. If the host is not interested in multicast traffic, it's also possible to
 * discard all multicast traffic. By default all multicast packets are accepted. The functionality
 * can be controlled using sl_wfx_add_multicast_addr_req_t and sl_wfx_remove_multicast_addr_req_t
 * messages.
 * @par Broadcast filtering
 * Broadcast filtering is a boolean option. When enabled, the device discards all received
 * packets sent to the broadcast address except ARP and DHCP messages. By default, all broadcast
 * packets are accepted. The functionality can be controlled using sl_wfx_set_broadcast_filter_req_t message.
 */

/**
 * @page WFM_CONCEPT_ROAM Roaming
 * @par
 * When operating in Wi-Fi client role, the device is capable of autonomously switching to
 * a different access point when the current access point is either lost or the signal strength
 * drops below the roaming threshold. The device will only consider access points that have
 * the same SSID and that otherwise have the same security capabilities as the previous access
 * point.
 * @par
 * The autonomous roaming functionality can be disabled by setting the corresponding option
 * in sl_wfx_connect_req_t message. The various roaming parameters may be adjusted using
 * sl_wfx_set_roam_parameters_req_t message. Parameter changes will be applied at the next connection.
 */

/**
 * @page WFM_CONCEPT_TX_RATE Transmit rate
 * @par
 * A Wi-Fi device may use a number of different data rates for transmission. When operating as a client,
 * a device adapts the rates it uses to match those the access point authorizes. However it is possible
 * to specify rates that the device will not use even if they are allowed by the network.
 * @par
 * The precise allowed rates may be adjusted using sl_wfx_set_tx_rate_parameters_req_t message.
 * Parameter changes will be applied at the next connection. If no overlap between these parameters
 * and the access point's supported rates list is found, it will default to using only 1Mbits/sec rate.
 */

/**
 * @}
 */

/**
 * @addtogroup WFM_GROUP_MESSAGES
 * @{
 */

/**
 * @brief Request message body for sl_wfx_set_mac_address_req_t.
 * @details
 *          | Field       | Default value    | Reset to default value |
 *          |:------------|:-----------------|:-----------------------|
 *          | MAC address | device dependent | when device reset      |
 *          <BR>
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_mac_address_req_body_s {
  /** MAC address of the interface. */
  uint8_t  mac_addr[SL_WFX_MAC_ADDR_SIZE];
  /** Reserved, set to zero. */
  uint16_t reserved;
} sl_wfx_set_mac_address_req_body_t;

/**
 * @brief Request message to set MAC address of the interface.
 * @details The host can use this request to set the MAC address of an interface.
 *          If not set, the device will use a built-in MAC address. Note that
 *          if multiple interfaces are used, the MAC address MUST be different
 *          on each interface.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | Yes             |
 *          | station        | No              |
 *          | AP             | No              |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_IDLE
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_mac_address_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_set_mac_address_req_body_t body;
} sl_wfx_set_mac_address_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_mac_address_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_mac_address_cnf_body_s {
  /**
   * @brief Status of the set request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the set request was completed successfully.
   *          <BR><B>any other value</B>: the set request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_mac_address_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_mac_address_req_t.
 * @ingroup WFM_GROUP_MODE_IDLE
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_mac_address_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_set_mac_address_cnf_body_t body;
} sl_wfx_set_mac_address_cnf_t;

/**
 * @brief Request message body for sl_wfx_connect_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_connect_req_body_s {
  /**
   * @brief Service Set Identifier (SSID) of the network.
   */
  sl_wfx_ssid_def_t ssid_def;
  /**
   * @brief Basic Service Set Identifier (BSSID) of the Access Point.
   * @details <B>broadcast address</B>: The device will connect to any matching access point.
   *          <BR><B>unicast address</B>: The device will only connect to the given Access Point.
   *          <BR>See @ref WFM_CONCEPT_BSSID for further details.
   */
  uint8_t  bssid[SL_WFX_BSSID_SIZE];
  /**
   * @brief Channel of the Access Point.
   * @details <B>0</B>: The device will connect to a matching Access Point on any channel.
   *          <BR><B>1 - 13</B>: The device will only connect to a matching Access Point on the given channel.
   */
  uint16_t channel;
  /**
   * @brief Security mode of the network.
   * @details <B>WFM_SECURITY_MODE_OPEN</B>: The device will only connect to an unsecured Access Point.
   *          <BR><B>WFM_SECURITY_MODE_WEP</B>: The device will only connect to a WEP Access Point.
   *          <BR><B>WFM_SECURITY_MODE_WPA2_WPA1_PSK</B>: The device will only connect to a WPA-Personal or a WPA2-Personal Access Point.
   *          <BR><B>WFM_SECURITY_MODE_WPA2_PSK</B>: The device will only connect to a WPA2-Personal access point.
   *          <BR><B>WFM_SECURITY_MODE_WPA3_SAE</B>: The device will only connect to a WPA3-SAE access point.
   *          <BR>See wfm_security_mode for enumeration values.
   */
  uint8_t  security_mode;
  /**
   * @brief Boolean option to prevent roaming between access points.
   * @details <B>0</B>: The device may roam to any matching access point within the same network.
   *          <BR><B>1</B>: The device will not roam to any other access point.
   */
  uint8_t  prevent_roaming;
  /**
   * @brief Protected Management Frames (PMF) mode.
   * @details <B>WFM_MGMT_FRAME_PROTECTION_DISABLED</B>: The device will not use PMF even if supported by the access point.
   *          <BR><B>WFM_MGMT_FRAME_PROTECTION_OPTIONAL</B>: The device will use PMF if supported by the access point.
   *          <BR><B>WFM_MGMT_FRAME_PROTECTION_MANDATORY</B>: The device will only connect to an access point supporting PMF.
   *          <BR>See wfm_mgmt_frame_protection for enumeration values.
   */
  uint16_t mgmt_frame_protection;
  /**
   * @brief Length of the network password.
   * @details <B>0 - 64</B>: The amount of bytes.
   */
  uint16_t password_length;
  /**
   * @brief Password of the network.
   * @details <B>64-bit WEP key</B>: 5 bytes in ASCII format or 10 bytes in HEX format.
   *          <BR><B>128-bit WEP key</B>: 13 bytes in ASCII format or 26 bytes in HEX format.
   *          <BR><B>WPA pass phrase</B>: 8 - 63 bytes in ASCII format.
   *          <BR><B>WPA PMK</B>: 64 bytes in HEX format.
   *          <BR>See @ref WFM_CONCEPT_PASSWORD for further details.
   */
  uint8_t  password[SL_WFX_PASSWORD_SIZE];
  /**
   * @brief Length of vendor-specific Information Element (IE) data.
   * @details <B>0 - 255</B>: The amount of bytes.
   */
  uint16_t ie_data_length;
  /**
   * @brief Vendor-specific IE data added to the 802.11 Association Request frames.
   * @details The IE data must be in 802.11 Vendor-Specific Element format.
   *          It may contain multiple concatenated IEs, up to the maximum length.
   *          <BR>See @ref WFM_CONCEPT_VENDOR_IE for further details.
   */
  uint8_t  ie_data[];
} sl_wfx_connect_req_body_t;

