espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/radio/wifi/wfx_fmac_driver/firmware/sl_wfx_cmd_api.h
/**
 * @brief Request message body for sl_wfx_set_max_ap_client_inactivity_req_t.
 * @details
 *          | Field             | Default value | Reset to default value |
 *          |:------------------|:--------------|:-----------------------|
 *          | inactivity_timeout | 65            | when interface stopped |
 *          <BR>
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_ap_client_inactivity_req_body_s {
  /**
   * @brief Maximum amount of client idle time.
   * @details <B>0</B>: The device will set the limit value to the device default.
   *          <BR><B>1 - 240</B>: The maximum number of seconds.
   */
  uint32_t inactivity_timeout;
} sl_wfx_set_max_ap_client_inactivity_req_body_t;

/**
 * @brief Request message for setting the maximum number of connected clients.
 * @details The host can use this request to limit the number of stations that
 *          can connect the started Wi-Fi network.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | No              |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_ap_client_inactivity_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_set_max_ap_client_inactivity_req_body_t body;
} sl_wfx_set_max_ap_client_inactivity_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_max_ap_client_count_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_ap_client_inactivity_cnf_body_s {
  /**
   * @brief Status of the set request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the set request was completed successfully.
   *          <BR><B>any other value</B>: the set request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_max_ap_client_inactivity_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_max_ap_client_inactivity_req_t.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_ap_client_inactivity_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_set_max_ap_client_inactivity_cnf_body_t body;
} sl_wfx_set_max_ap_client_inactivity_cnf_t;

/**
 * @brief Request message body for sl_wfx_set_roam_parameters_req_t.
 * @details
 *          | Field            | Default value    | Reset to default value |
 *          |:-----------------|:-----------------|:-----------------------|
 *          | rcpi_threshold    | 60               | when device reset      |
 *          | rcpi_hysteresis   | 120              | when device reset      |
 *          | beacon_lost_count  | 10               | when device reset      |
 *          | channel_list_count | 13               | when device reset      |
 *          | channel_number    | 1 to 13          | when device reset      |
 *          <BR>
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_roam_parameters_req_body_s {
  /**
   * @brief Received Channel Power Indicator (RCPI) limit for a roaming attempt.
   * @details <B>0</B>: The device will set the limit value to the device default.
   *          <BR><B>1 - 220</B>: RCPI limit for a roaming attempt.
   *          <BR>See @ref WFM_CONCEPT_RCPI for further details.
   */
  uint8_t  rcpi_threshold;
  /**
   * @brief Upper RCPI limit that must be attained before triggering roaming again.
   * @details <B>0</B>: The device will set the limit value to the device default.
   *          <BR><B>1 - 220</B>: RCPI limit to re-enable automatic roaming based on RCPI.
   *          This value is used to prevent automatic roaming from triggering again and again
   *          while the signal strength stays close to the rcpi_threshold value.
   *          rcpi_hysteresis should be set to a value grater than rcpi_threshold.
   *          <BR>See @ref WFM_CONCEPT_RCPI for further details.
   */
  uint8_t  rcpi_hysteresis;
  /**
   * @brief Beacon loss limit for a roaming attempt.
   * @details <B>0</B>: The device will set the limit value to the device default.
   *          <BR><B>1 - 255</B>: Beacon loss limit for a roaming attempt.
   */
  uint8_t  beacon_lost_count;
  /**
   * @brief The amount of specific channels to scan.
   * @details <B>0</B>: The device will set the channel list to the device default.
   *          <BR><B>1 - 13</B>: The amount of specific channels to scan.
   */
  uint8_t  channel_list_count;
  /**
   * @brief List of specific channels to scan.
   * @details <B>1 - 13</B>: The channel number to scan per byte.
   *          <BR>Must contain the same number of channels as specified in channel_list_count.
   *          <BR>See @ref WFM_CONCEPT_SCAN for further details.
   */
  uint8_t  channel_number[];
} sl_wfx_set_roam_parameters_req_body_t;

/**
 * @brief Request message for setting the roaming parameters.
 * @details The host can use this request to configure the roaming parameters
 *          used by the device.
 *          <BR>See @ref WFM_CONCEPT_ROAM for further details.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | Yes             |
 *          | station        | Yes             |
 *          | AP             | No              |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_roam_parameters_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_set_roam_parameters_req_body_t body;
} sl_wfx_set_roam_parameters_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_roam_parameters_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_roam_parameters_cnf_body_s {
  /**
   * @brief Status of the set request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the set request was completed successfully.
   *          <BR><B>any other value</B>: the set request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_roam_parameters_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_roam_parameters_req_t.
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_roam_parameters_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_set_roam_parameters_cnf_body_t body;
} sl_wfx_set_roam_parameters_cnf_t;

/**
 * @brief Request message body for sl_wfx_set_tx_rate_parameters_req_t.
 * @details
 *          | Field          | Default value                 | Reset to default value |
 *          |:---------------|:------------------------------|:-----------------------|
 *          | rate_set_bitmask | all 802.11bg rates, MCS 0 - 7 | when device reset      |
 *          <BR>
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_tx_rate_parameters_req_body_s {
  /**
   * @brief Reserved, set to zero.
   */
  uint16_t reserved;
  /**
   * @brief Set to 1 to use Minstrel rate algorithm
   */
  uint16_t use_minstrel;
  /**
   * @brief TX rate set parameters.
   */
  sl_wfx_rate_set_bitmask_t rate_set_bitmask;
} sl_wfx_set_tx_rate_parameters_req_body_t;

/**
 * @brief Request message for setting the TX rate set parameters.
 * @details The host can use this request to configure the TX rate
 *          set parameters of the device. The rate set determines
 *          what data rates will be used by the device to transmit data
 *          frames.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | Yes             |
 *          | station        | Yes             |
 *          | AP             | No              |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_tx_rate_parameters_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_set_tx_rate_parameters_req_body_t body;
} sl_wfx_set_tx_rate_parameters_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_tx_rate_parameters_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_tx_rate_parameters_cnf_body_s {
  /**
   * @brief Status of the set request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the set request was completed successfully.
   *          <BR><B>any other value</B>: the set request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_tx_rate_parameters_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_tx_rate_parameters_req_t.
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_tx_rate_parameters_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_set_tx_rate_parameters_cnf_body_t body;
} sl_wfx_set_tx_rate_parameters_cnf_t;

/**
 * @brief Request message body for sl_wfx_set_arp_ip_address_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_arp_ip_address_req_body_s {
  /**
   * @brief List of offloaded ARP IP addresses.
   * @details The device will automatically reply to an ARP request that matches
   *          one the addresses on the list. Note that addresses not in use must
   *          be set to zero. Offloading is disabled by setting all addresses to
   *          zero.
   *          <BR>See @ref WFM_CONCEPT_OFFLOADING for further details.
   */
  uint32_t arp_ip_addr[SL_WFX_ARP_IP_ADDR_SIZE];
} sl_wfx_set_arp_ip_address_req_body_t;

/**
 * @brief Request message for setting the Address Resolution Protocol (ARP) offloading state.
 * @details The host can use this request to offload handling of ARP requests to the device.
 *          When offloading is enabled, the device will automatically respond to ARP requests
 *          with an ARP reply. By default offloading is disabled. Offloading is reset to
 *          the default state when the interface is reset.
 *          <BR>See @ref WFM_CONCEPT_OFFLOADING for further details.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | Yes             |
 *          | AP             | No              |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_arp_ip_address_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_set_arp_ip_address_req_body_t body;
} sl_wfx_set_arp_ip_address_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_arp_ip_address_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_arp_ip_address_cnf_body_s {
  /**
   * @brief Status of the set request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the set request was completed successfully.
   *          <BR><B>any other value</B>: the set request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_arp_ip_address_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_arp_ip_address_req_t.
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_arp_ip_address_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_set_arp_ip_address_cnf_body_t body;
} sl_wfx_set_arp_ip_address_cnf_t;

/**
 * @brief Request message body for sl_wfx_set_ns_ip_address_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_ns_ip_address_req_body_s {
  /**
   * @brief List of offloaded NS IP addresses.
   * @details The device will automatically reply to a NS that matches one the
   *          addresses on the list. Note that addresses not in use must be set
   *          to zero. Offloading is disabled by setting all addresses to zero.
   *          <BR>See @ref WFM_CONCEPT_OFFLOADING for further details.
   */
  sl_wfx_ns_ip_addr_t ns_ip_addr[SL_WFX_NS_IP_ADDR_SIZE];
} sl_wfx_set_ns_ip_address_req_body_t;

/**
 * @brief Request message for setting the Neighbor Discovery Protocol (NDP) offloading state.
 * @details The host can use this request to offload handling of IPv6 Neighbor Solicitations
 *          to the device. When offloading is enabled, the device will automatically respond
 *          to a solicitation with a Neighbor Advertisement.  By default offloading is disabled.
 *          Offloading is reset to the default state when the interface is reset.
 *          <BR>See @ref WFM_CONCEPT_OFFLOADING for further details.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | Yes             |
 *          | AP             | No              |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_ns_ip_address_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_set_ns_ip_address_req_body_t body;
} sl_wfx_set_ns_ip_address_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_ns_ip_address_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_ns_ip_address_cnf_body_s {
  /**
   * @brief Status of the set request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the set request was completed successfully.
   *          <BR><B>any other value</B>: the set request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_ns_ip_address_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_ns_ip_address_req_t.
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_ns_ip_address_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_set_ns_ip_address_cnf_body_t body;
} sl_wfx_set_ns_ip_address_cnf_t;

/**
 * @brief Request message body for sl_wfx_set_broadcast_filter_req_t.
 * @details
 *          | Field  | Default value | Reset to default value |
 *          |:-------|:--------------|:-----------------------|
 *          | Filter | 0             | when interface stopped |
 *          <BR>
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_broadcast_filter_req_body_s {
  /**
   * @brief Boolean option for broadcast filtering.
   * @details <B>0</B>: The device will forward all received broadcast frames to the host.
   *          <BR><B>1</B>: The device will only forward ARP and DHCP frames to the host,
   *                        other broadcast frames are discarded.
   *          <BR><B>2</B>: The device will discard all broadcast frames.
   *          <BR>See @ref WFM_CONCEPT_FILTERING for further details.
   */
  uint32_t filter;
} sl_wfx_set_broadcast_filter_req_body_t;

/**
 * @brief Request message for setting broadcast filter state.
 * @details The host can use this request to configure the state of the broadcast filter.
 *          When enabled, the device will only forward certain broadcast frames to the
 *          host and automatically discard the rest.
 *          <BR>See @ref WFM_CONCEPT_FILTERING for further details.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | Yes             |
 *          | AP             | No              |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_broadcast_filter_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_set_broadcast_filter_req_body_t body;
} sl_wfx_set_broadcast_filter_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_broadcast_filter_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_broadcast_filter_cnf_body_s {
  /**
   * @brief Status of the set request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the set request was completed successfully.
   *          <BR><B>any other value</B>: the set request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_broadcast_filter_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_broadcast_filter_req_t.
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_broadcast_filter_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_set_broadcast_filter_cnf_body_t body;
} sl_wfx_set_broadcast_filter_cnf_t;

/**
 * @brief Request message body for sl_wfx_set_scan_parameters_req_t.
 * @details
 *          | Field              | Default value    | Reset to default value |
 *          |:-------------------|:-----------------|:-----------------------|
 *          | active_channel_time  | 50               | when device reset      |
 *          | passive_channel_time | 110              | when device reset      |
 *          | num_of_probe_requests | 1                | when device reset      |
 *          <BR>
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_scan_parameters_req_body_s {
  /**
   * @brief Set to 0 for device default, 1 - 550 TUs
   */
  uint16_t active_channel_time;
  /**
   * @brief Set to 0 for device default, 1 - 550 TUs
   */
  uint16_t passive_channel_time;
  /**
   * @brief Set to 0 for device default, 1 - 2
   */
  uint16_t num_of_probe_requests;
  /**
   * @brief Reserved, set to zero.
   */
  uint16_t reserved;
} sl_wfx_set_scan_parameters_req_body_t;

/**
 * @brief Request message for setting scan parameters.
 * @details The host can use this request to configure the scan parameters
 *          used by the device.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | Yes             |
 *          | station        | Yes             |
 *          | AP             | No              |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_scan_parameters_req_s {
  sl_wfx_header_t header;
  sl_wfx_set_scan_parameters_req_body_t body;
} sl_wfx_set_scan_parameters_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_scan_parameters_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_scan_parameters_cnf_body_s {
  /**
   * @brief Status of the set request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the set request was completed successfully.
   *          <BR><B>any other value</B>: the set request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_scan_parameters_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_scan_parameters_req_t.
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_scan_parameters_cnf_s {
  sl_wfx_header_t header;
  sl_wfx_set_scan_parameters_cnf_body_t body;
} sl_wfx_set_scan_parameters_cnf_t;

/**
 * @brief Request message body for sl_wfx_set_unicast_filter_req_t.
 * @details
 *          | Field  | Default value | Reset to default value |
 *          |:-------|:--------------|:-----------------------|
 *          | Filter | 1             | when interface stopped |
 *          <BR>
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_unicast_filter_req_body_s {
  /**
   * @brief Boolean option for unicast filtering.
   * @details <B>0</B>: The device will forward all received unicast frames to the host.
   *          <BR><B>1</B>: The device will only forward unicast frames whose destination
   *                        address matches the device MAC address.
   *          <BR>See @ref WFM_CONCEPT_FILTERING for further details.
   */
  uint32_t filter;
} sl_wfx_set_unicast_filter_req_body_t;

/**
 * @brief Request message for setting unicast filter state.
 * @details The host can use this request to configure the state of the unicast filter.
 *          When enabled, the device will only forward certain unicast frames to the
 *          host and automatically discard the rest.
 *          <BR>See @ref WFM_CONCEPT_FILTERING for further details.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | No              |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_unicast_filter_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_set_unicast_filter_req_body_t body;
} sl_wfx_set_unicast_filter_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_unicast_filter_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_unicast_filter_cnf_body_s {
  /**
   * @brief Status of the set request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the set request was completed successfully.
   *          <BR><B>any other value</B>: the set request failed.
   *          <BR>See ::sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_unicast_filter_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_unicast_filter_req_t.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_unicast_filter_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_set_unicast_filter_cnf_body_t body;
} sl_wfx_set_unicast_filter_cnf_t;

/**
 * @brief Request message body for sl_wfx_add_whitelist_addr_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_whitelist_addr_req_body_s {
  /**
   * @brief MAC address to add.
   * @details <B>broadcast address</B>: The device will allow all MAC addresses.
   *          <BR><B>unicast address</B>: The device will add the given address to the whitelist.
   */
  uint8_t  mac[SL_WFX_MAC_ADDR_SIZE];
} sl_wfx_add_whitelist_addr_req_body_t;

/**
 * @brief Request message for adding a MAC address to the device whitelist.
 * @details The host can use this request to add a MAC address to the list of allowed MAC addresses.
 *          When the first address is added the whitelist, the device will prevent communication with
 *          any devices whose MAC address does not match any of the addresses on the list. Setting a
 *          whitelist will clear all entries from the device blacklist. The default state is to allow
 *          all MAC addresses. The whitelist is reset to the default state when the interface is reset.
 *          Up to 8 MAC addresses may be added.
 *          <BR>See @ref WFM_CONCEPT_FILTERING for further details.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | No              |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_whitelist_addr_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_add_whitelist_addr_req_body_t body;
} sl_wfx_add_whitelist_addr_req_t;

