espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/radio/wifi/wfx_fmac_driver/firmware/sl_wfx_cmd_api.h
/**
 * @brief Confirmation message body for sl_wfx_add_whitelist_addr_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_whitelist_addr_cnf_body_s {
  /**
   * @brief Status of the add request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the add request was completed successfully.
   *          <BR><B>any other value</B>: the add request failed.
   *          <BR>See ::sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_add_whitelist_addr_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_add_whitelist_addr_req_t.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_whitelist_addr_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_add_whitelist_addr_cnf_body_t body;
} sl_wfx_add_whitelist_addr_cnf_t;

/**
 * @brief Request message body for sl_wfx_add_blacklist_addr_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_blacklist_addr_req_body_s {
  /**
   * @brief MAC address to add.
   * @details <B>broadcast address</B>: The device will deny all MAC addresses.
   *          <BR><B>unicast address</B>: The device will add the given address to the blacklist.
   */
  uint8_t  mac[SL_WFX_MAC_ADDR_SIZE];
} sl_wfx_add_blacklist_addr_req_body_t;

/**
 * @brief Request message for adding a MAC address to the device blacklist.
 * @details The host can use this request to add a MAC address to the list of denied MAC addresses.
 *          When the first address is added the blacklist, the device will prevent communication with
 *          any device whose MAC address matches any of the addresses on the list. Setting a blacklist
 *          will clear all entries from the device whitelist. The default state is to allow all MAC
 *          addresses. The blacklist is reset to the default state when the interface is reset.
 *          Up to 8 MAC addresses may be added.
 *          <BR>See @ref WFM_CONCEPT_FILTERING for further details.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | No              |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_blacklist_addr_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_add_blacklist_addr_req_body_t body;
} sl_wfx_add_blacklist_addr_req_t;

/**
 * @brief Confirmation message body for sl_wfx_add_blacklist_addr_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_blacklist_addr_cnf_body_s {
  /**
   * @brief Status of the add request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the add request was completed successfully.
   *          <BR><B>any other value</B>: the add request failed.
   *          <BR>See ::sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_add_blacklist_addr_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_add_blacklist_addr_req_t.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_add_blacklist_addr_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_add_blacklist_addr_cnf_body_t body;
} sl_wfx_add_blacklist_addr_cnf_t;

/**
 * @brief Request message body for sl_wfx_set_max_tx_power_req_t.
 * @details
 *          | Field      | Default value    | Reset to default value |
 *          |:-----------|:-----------------|:-----------------------|
 *          | max_tx_power | device dependent | when device reset      |
 *          <BR>
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_tx_power_req_body_s {
  /**
   * @brief Maximum transmit power to set
   * @details Expressed in units of 0.1d_bm.
   */
  int32_t  max_tx_power;
} sl_wfx_set_max_tx_power_req_body_t;

/**
 * @brief Request message for setting the maximum transmit power of the device.
 * @details The host can use this request to set a maximum transmit power.
 *          The device can still use a lower transmit power depending on regulatory rules
 *          or internal limitations.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | Yes             |
 *          | station        | Yes             |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_tx_power_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_set_max_tx_power_req_body_t body;
} sl_wfx_set_max_tx_power_req_t;

/**
 * @brief Confirmation message body for sl_wfx_set_max_tx_power_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_tx_power_cnf_body_s {
  /**
   * @brief Status of the add request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the add request was completed successfully.
   *          <BR><B>any other value</B>: the add request failed.
   *          <BR>See ::sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_set_max_tx_power_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_set_max_tx_power_req_t.
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_set_max_tx_power_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_set_max_tx_power_cnf_body_t body;
} sl_wfx_set_max_tx_power_cnf_t;

/**
 * @struct sl_wfx_get_max_tx_power_req_t
 * @brief Request message for getting the maximum transmit power
 * @details The host can use this request to get the current value of maximum transmit power.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | Yes             |
 *          | station        | Yes             |
 *          | AP             | Yes             |
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef sl_wfx_header_t sl_wfx_get_max_tx_power_req_t;

/**
 * @brief Confirmation message body for sl_wfx_get_max_tx_power_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_max_tx_power_cnf_body_s {
  /**
   * @brief Status of the add request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the add request was completed successfully.
   *          <BR><B>any other value</B>: the add request failed.
   *          <BR>See ::sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
  /**
   * @brief Maximum transmit power for RF port 1.
   * @details Expressed in units of 0.1d_bm.
   */
  int32_t  max_tx_power_rf_port1;
  /**
   * @brief Maximum transmit power for RF port 2.
   * @details Expressed in units of 0.1d_bm.
   */
  int32_t  max_tx_power_rf_port2;
} sl_wfx_get_max_tx_power_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_get_max_tx_power_req_t.
 * @ingroup WFM_GROUP_MODE_IDLE
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_max_tx_power_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_get_max_tx_power_cnf_body_t body;
} sl_wfx_get_max_tx_power_cnf_t;

/**
 * @struct sl_wfx_get_pmk_req_t
 * @brief Request message for getting the Pairwise Master Key (PMK).
 * @details The host can use this request to retrieve the Pairwise Master Key (PMK)
 *          used to connect to the current secure network. PMK can be given
 *          in the next sl_wfx_connect_req_t message to speed up connection
 *          process. See @ref WFM_CONCEPT_PASSWORD for further details.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | Yes             |
 *          | AP             | Yes             |
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef sl_wfx_header_t sl_wfx_get_pmk_req_t;

/**
 * @brief Confirmation message body for sl_wfx_get_pmk_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_pmk_cnf_body_s {
  /**
   * @brief Status of the add request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the get request was completed successfully.
   *          <BR><B>any other value</B>: the get request failed.
   *          <BR>See ::sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
  /**
   * @brief Length of the Pairwise Master Key.
   * @details <B>0 - 64</B>: The amount of bytes.
   */
  uint32_t password_length;
  /**
   * @brief PMK of the network.
   * @details <B>WPA PMK</B>: 64 bytes in HEX format.
   *          <BR>See @ref WFM_CONCEPT_PASSWORD for further details.
   */
  uint8_t  password[SL_WFX_PASSWORD_SIZE];
} sl_wfx_get_pmk_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_get_pmk_req_t.
 * @ingroup WFM_GROUP_MODE_STA
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_pmk_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_get_pmk_cnf_body_t body;
} sl_wfx_get_pmk_cnf_t;

/**
 * @brief Request message body for sl_wfx_get_ap_client_signal_strength_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_ap_client_signal_strength_req_body_s {
  /**
   * @brief MAC address of the station.
   */
  uint8_t  mac[SL_WFX_MAC_ADDR_SIZE];
} sl_wfx_get_ap_client_signal_strength_req_body_t;

/**
 * @brief Request message for retrieving the signal strength of a client of the started Wi-Fi network.
 * @details The host can use this request to retrieve the signal strength of a client of the started Wi-Fi network.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | No              |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_ap_client_signal_strength_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_get_ap_client_signal_strength_req_body_t body;
} sl_wfx_get_ap_client_signal_strength_req_t;

/**
 * @brief Confirmation message body for sl_wfx_get_ap_client_signal_strength_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_ap_client_signal_strength_cnf_body_s {
  /**
   * @brief Status of the get request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the get request was completed.
   *          <BR><B>any other value</B>: the get request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
  /**
   * @brief Received Channel Power Indicator (RCPI) of the client.
   * @details See @ref WFM_CONCEPT_RCPI for further details.
   */
  uint32_t rcpi;
} sl_wfx_get_ap_client_signal_strength_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_get_ap_client_signal_strength_req_t.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_get_ap_client_signal_strength_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_get_ap_client_signal_strength_cnf_body_t body;
} sl_wfx_get_ap_client_signal_strength_cnf_t;

/**
 * @brief Request message body for sl_wfx_ext_auth_req_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_ext_auth_req_body_s {
  /**
   * @brief Type of the authentication message
   * @details See ::sl_wfx_ext_auth_data_type_t for enumeration values.
   */
  uint16_t auth_data_type;
  /**
   * @brief Length of the authentication message
   */
  uint16_t auth_data_length;
  /**
   * @brief The authentication message
   */
  uint8_t auth_data[];
} sl_wfx_ext_auth_req_body_t;

/**
 */
typedef struct __attribute__((__packed__)) sl_wfx_ext_auth_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_ext_auth_req_body_t body;
} sl_wfx_ext_auth_req_t;

/**
 * @brief Confirmation message body for sl_wfx_ext_auth_cnf_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_ext_auth_cnf_body_s {
  /**
   * @brief Status of the update request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the authentication request was completed.
   *          <BR><B>any other value</B>: the authentication request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_ext_auth_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_ext_auth_req_t.
 * @ingroup WFM_GROUP_MODE_STA
 */
typedef struct __attribute__((__packed__)) sl_wfx_ext_auth_cnf_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_ext_auth_cnf_body_t body;
} sl_wfx_ext_auth_cnf_t;

/**
 * @brief Indication message body for sl_wfx_ext_auth_ind_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_ext_auth_ind_body_s {
  /**
   * @brief Type of the authentication message
   * @details See ::sl_wfx_ext_auth_data_type_t for enumeration values.
   */
  uint16_t auth_data_type;
  /**
   * @brief Length of the authentication message
   */
  uint16_t auth_data_length;
  /**
   * @brief The authentication message
   */
  uint8_t auth_data[];
} sl_wfx_ext_auth_ind_body_t;

/**
 */
typedef struct __attribute__((__packed__))  sl_wfx_ext_auth_ind_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Indication message body. */
  sl_wfx_ext_auth_ind_body_t body;
} sl_wfx_ext_auth_ind_t;

/**
 * @brief Request message body for sl_wfx_ap_scan_filter_req_body_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_ap_scan_filter_req_body_s {
  /**
   * @brief Length of vendor-specific Information Element (IE) byte pattern.
   * @details <B>0</B>: The filter is disabled
   *          <BR><B>1 - SL_WFX_IE_DATA_FILTER_SIZE</B>: The amount of bytes.
   */
  uint16_t ie_data_length;
  /**
   * @brief Vendor-specific IE byte pattern, starting from the Organization
   *        Identifier field.
   */
  uint8_t ie_data[SL_WFX_IE_DATA_FILTER_SIZE];
  /**
   * @brief Vendor-specific IE byte pattern mask.
   * @details The byte pattern mask is ANDed with the frame data before
   *          pattern matching, fill with 0xFF to match the whole pattern.
   */
  uint8_t ie_data_mask[SL_WFX_IE_DATA_FILTER_SIZE];
} sl_wfx_ap_scan_filter_req_body_t;

/**
 * @brief Request message for setting probe request forwarding filter.
 * @details The host can use this request to set the filter for forwarded
 *          probe requests. Any probe request where one the vendor-specific
 *          IEs matches the given filter, is forwarded to the host using a
 *          sl_wfx_ap_scan_filter_ind_t indication message. The forwarding can
 *          be disabled by setting the IE byte pattern length to zero.
 *          | Interface mode | Request allowed |
 *          |:---------------|:----------------|
 *          | idle           | No              |
 *          | station        | No              |
 *          | AP             | Yes             |
 *          <BR>
 * @ingroup WFM_GROUP_MESSAGES
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_ap_scan_filter_req_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Request message body. */
  sl_wfx_ap_scan_filter_req_body_t body;
} sl_wfx_ap_scan_filter_req_t;

/**
 * @brief Confirmation message body for sl_wfx_ap_scan_filter_cnf_body_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_ap_scan_filter_cnf_body_s {
  /**
   * @brief Status of the set request.
   * @details <B>WFM_STATUS_SUCCESS</B>: the set request was completed successfully.
   *          <BR><B>any other value</B>: the set request failed.
   *          <BR>See sl_wfx_fmac_status_t for enumeration values.
   */
  uint32_t status;
} sl_wfx_ap_scan_filter_cnf_body_t;

/**
 * @brief Confirmation message for sl_wfx_ap_scan_filter_cnf_t.
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_ap_scan_filter_cnf_t {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Confirmation message body. */
  sl_wfx_ap_scan_filter_cnf_body_t body;
} sl_wfx_ap_scan_filter_cnf_t;

/**
 * @brief Indication message body for sl_wfx_ap_scan_filter_ind_body_t.
 */
typedef struct __attribute__((__packed__)) sl_wfx_ap_scan_filter_ind_body_s {
  /**
   * @brief MAC address of the station.
   */
  uint8_t mac[SL_WFX_MAC_ADDR_SIZE];
  /**
   * @brief reserved field, set to 0
   */
  uint16_t reserved;
  /**
   * @brief Received Channel Power Indicator (RCPI) of the station.
   * @details See @ref WFM_CONCEPT_RCPI for further details.
   */
  uint16_t rcpi;
  /**
   * @brief Length of access point Information Element (IE) data in bytes.
   */
  uint16_t ie_data_length;
  /**
   * @brief Station IE data from the 802.11 Probe Request frame.
   */
  uint8_t ie_data[];
} sl_wfx_ap_scan_filter_ind_body_t;

/**
 * @brief Indication message used to signal a received probe request.
 * @details The device will send this indication when a probe request matching
 *          the filter set with sl_wfx_ap_scan_filter_req_t, has been
 *          received.
 * @ingroup WFM_GROUP_MESSAGES
 * @ingroup WFM_GROUP_MODE_AP
 */
typedef struct __attribute__((__packed__)) sl_wfx_ap_scan_filter_ind_s {
  /** Common message header. */
  sl_wfx_header_t header;
  /** Indication message body. */
  sl_wfx_ap_scan_filter_ind_body_t body;
} sl_wfx_ap_scan_filter_ind_t;

/**************************************************/

/**
 * @}
 */

/**
 * @}
 */

#endif /* _SL_WFX_CMD_API_H_ */
